modm-ext/archive-stmicro-svd/rm_rm0453_stm32wl54ccu6@m0.svd
      <register>
        <name>TZSC_SECCFGR1</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>AESSEC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RNGSEC</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PKASEC</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TZSC_PRIVCFGR1</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>AESPRIV</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RNGPRIV</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SUBGHZSPIPRIV</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PKAPRIV</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TZSC_MPCWM1_UPWMR</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>LGTH</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TZSC_MPCWM1_UPWWMR</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>LGTH</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TZSC_MPCWM2_UPWMR</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>LGTH</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TZSC_MPCWM3_UPWMR</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>LGTH</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>SUBGHZSPI</name>
      <baseAddress>0x58010000</baseAddress>
      <register>
        <name>GBSYNCR</name>
        <addressOffset>0x6ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>BITSYNCDIS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXDINV</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBITSYNCEN</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GPKTCTL1AR</name>
        <addressOffset>0x6b8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WHITEINI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>INFSSQEQEN</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>INFSQEQSEL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CONTTX</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNCDETEN</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GWHITEINIRL</name>
        <addressOffset>0x6b9</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WHITEINI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GCRCINIRH</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRCINI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GCRCINIRL</name>
        <addressOffset>0x6bd</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRCINI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GCRCPOLRH</name>
        <addressOffset>0x6be</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRCPOL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GCRCPOLRL</name>
        <addressOffset>0x6bf</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRCPOL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR7</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR6</name>
        <addressOffset>0x6c1</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR5</name>
        <addressOffset>0x6c2</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR4</name>
        <addressOffset>0x6c3</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR3</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR2</name>
        <addressOffset>0x6c5</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR1</name>
        <addressOffset>0x6c6</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSYNCR0</name>
        <addressOffset>0x6c7</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LSYNCRH</name>
        <addressOffset>0x740</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LSYNCRL</name>
        <addressOffset>0x741</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCWORD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RNGR3</name>
        <addressOffset>0x819</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RNDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RNGR2</name>
        <addressOffset>0x81a</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RNDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RNGR1</name>
        <addressOffset>0x81b</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RNDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RNGR0</name>
        <addressOffset>0x81c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RNDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RXGAINCR</name>
        <addressOffset>0x8ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PMODE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SENSI_ADJUST</name>
            <bitOffset>2</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PAOCPR</name>
        <addressOffset>0x8e7</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OCP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HSEINTRIMR</name>
        <addressOffset>0x911</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HSEOUTTRIMR</name>
        <addressOffset>0x912</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMPSC0R</name>
        <addressOffset>0x916</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>CLKDE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PCR</name>
        <addressOffset>0x91a</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>CLV</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CLE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMPSC2R</name>
        <addressOffset>0x923</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DRV</name>
            <bitOffset>1</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
  </peripherals>
</device>
